NSCameraUsageDescription = "書類のスキャンや写真・動画の撮影には、カメラへのアクセスが必要です。";
NSFaceIDUsageDescription = "顔認証を利用した認証にはFace IDが必要です。";
NSLocationAlwaysUsageDescription = "このアプリは位置情報を利用して地域間の移動時に自動的にファイルのアップロードをトリガーします。";
NSPhotoLibraryUsageDescription = "写真や動画をクラウドにアップロードするには、フォトライブラリへのアクセスが必要です。";
NSPhotoLibraryAddUsageDescription = "写真や動画をクラウドにアップロードするには、フォトライブラリへのアクセスが必要です。";
NSMicrophoneUsageDescription = "ボイスノートを作成するには、マイクへのアクセスが必要です。";
NSLocationWhenInUseUsageDescription = "このアプリは位置情報を使って動きを検知し自動的にファイルをアップロードします。GPSは使用せず位置情報も保存しません。";
NSLocationAlwaysAndWhenInUseUsageDescription = "このアプリは大きな動きが検出されると自動的にファイルのアップロードを開始するためにバックグラウンドでも位置情報にアクセスする必要があります。GPSは使用しません。";
